/* Template name */
"Active Directory" = "Active Directory";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* Dialog Title */
"Adding configuration failed" = "Määrittelyn lisääminen epäonnistui";

/* Status window message */
"Adding server to configuration" = "Lisätään palvelinta määrittelyyn";

/* Status window message */
"Attempting to bind computer to directory" = "Yritetään sitoa tietokonetta hakemistoon";

/* Status window message */
"Attempting to unbind from Directory" = "Yritetään poistaa sidosta hakemistosta";

/* No comment provided by engineer. */
"Bind\\U2026" = "Sido…";

/* Dialog message */
"Binding is required by the directory.  Add new LDAP server cancelled." = "Hakemisto vaatii sitomisen. Uuden LDAP-palvelimen lisääminen kumottiin.";

/* Dialog Title */
"Binding required" = "Sitominen vaaditaan";

/* No comment provided by engineer. */
"Bound to the directory as" = "Sidottu hakemistoon nimellä";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* Dialog message */
"Computer is bound" = "Tietokone on sidottu";

/* Dialog Title */
"Computer record exists" = "Tietokonetietue on olemassa";

/* Status window message */
"Computer record missing from the directory.  Force unbinding." = "Tietokonetietue puuttuu hakemistosta. Pakota poistamaan sidos.";

/* Status window message */
"Configuration of new server complete" = "Uuden palvelimen määrittely on suoritettu";

/* Default button continue */
"Continue" = "Jatka";

/* appended to duplicated configs */
"copy" = "kopio";

/* Dialog Title */
"Could not contact server" = "Palvelimeen ei saatu yhteyttä";

/* Dialog message */
"Could not contact the LDAP server to unbind.  Would you like to forcibly remove this configuration?" = "LDAP-palvelimeen ei saatu yhteyttä sidoksen poistamista varten. Haluatko pakottaa poistamaan määrittelyn?";

/* No comment provided by engineer. */
"Custom" = "Muokattu";

/* Default Attribute Types - title of global attribute type group */
"Default Attribute Types" = "Oletusattribuuttityypit";

/* No comment provided by engineer. */
"Delete LDAP Server?" = "Poistetaanko LDAP-palvelin?";

/* Status window message */
"Detecting required security levels and binding requirements" = "Tunnistetaan vaadittuja turvallisuustasoja ja sidosvaatimuksia";

/* Dialog Title
   Status window message */
"Directory binding is not supported" = "Hakemistosidontaa ei tueta";

/* No comment provided by engineer. */
"Authenticated directory binding is optional. Enter information to bind." = "Todennettu hakemiston sitominen on valinnaista. Syötä sitomiseen tarvittavat tiedot.";

/* No comment provided by engineer. */
"Authenticated directory binding is required. Enter information to bind." = "Todennettu hakemiston sitominen on pakollista. Syötä sitomiseen tarvittavat tiedot.";

/* No comment provided by engineer. */
"An unexpected error occurred" = "Tapahtui odottamaton virhe";

/* No comment provided by engineer. */
"Don\\U02BCt Add" = "Älä lisää";

/* No comment provided by engineer. */
"Failed to allocate data buffer" = "Datapuskurin varaaminen epäonnistui";

/* No comment provided by engineer. */
"Failed to allocate data list." = "Dataluettelon varaaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to build data list from strings." = "Dataluettelon rakentaminen merkkijonoista epäonnistui.";

/* No comment provided by engineer. */
"Failed to open LDAPv3 node." = "LDAPv3-solmun avaaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to save the LDAP configuration." = "LDAP-määrittelyn tallentaminen epäonnistui.";

/* No comment provided by engineer. */
"From Server" = "Palvelimelta";

/* No comment provided by engineer. */
"Hide Options" = "Kätke valinnat";

/* Status window message */
"Initial server information discovery" = "Alustava palvelintietojen etsintä";

/* Dialog Title */
"Insufficient privileges" = "Riittämättömät oikeudet";

/* Dialog Title */
"Invalid credentials supplied" = "Syötettiin virheelliset valtakirjat";

/* No comment provided by engineer. */
"Invalid credentials supplied.  Please re-enter." = "Syötettiin virheelliset valtakirjat. Yritä uudelleen.";

/* Error converting */
"Odd number of $ characters in literal mapping" = "Pariton määrä $-merkkejä kirjaimellisessa kuvauksessa";

/* Default button OK */
"OK" = "OK";

/* Template name */
"Open Directory Server" = "Open Directory -palvelin";

/* No comment provided by engineer. */
"Overwrite" = "Korvaa";

/* No comment provided by engineer. */
"Please confirm deletion." = "Vahvista poisto.";

/* Dialog message */
"Please enter valid credentials that allow access to the directory specified." = "Syötä valtakirjat, jotka mahdollistavat pääsyn määritettyyn hakemistoon.";

/* Template name */
"RFC 2307 (Unix)" = "RFC 2307 (Unix)";

/* Dialog Title */
"Security requirements violation" = "Suojausvaatimusten rikkomus";

/* Dialog Title */
"Server already configured" = "Palvelin on jo määritelty";

/* Dialog Title */
"Server did not respond" = "Palvelin ei vastannut";

/* No comment provided by engineer. */
"Show Options" = "Näytä valinnat";

/* Dialog Title */
"Strong authentication not supported" = "Vahvaa todentamista ei tueta";

/* default name when saving template - do not include .plist */
"Template" = "Työpohja";

/* Dialog message */
"The account you provided does not have enough privileges.  Please contact a network administrator for assistance." = "Syötetyllä tunnuksella ei ole riittävästi oikeuksia. Pyydä apua verkon ylläpitäjältä.";

/* Dialog message */
"The credentials you supplied were not valid, please try again." = "Syötetyt valtakirjat ovat virheelliset. Yritä uudelleen.";

/* Dialog message */
"The server you are adding does not support strong authentication.  Passwords sent to this server may be readable by other computers on the network." = "Lisättävä palvelin ei tue vahvaa todentamista. Palvelimelle lähetetyt salasanat voivat olla verkon muiden tietokoneiden luettavissa.";

/* Dialog message */
"The server you selected does not comply with the configured security policy.  Add new LDAP server cancelled." = "Valittu palvelin ei ole määritellyn turvallisuuskäytännön mukainen. Uuden LDAP-palvelimen lisääminen kumottiin.";

/* Dialog message */
"The server you specified could not be contacted.  Would you like to manually configure?" = "Määriteltyyn palvelimeen ei saatu yhteyttä. Haluatko määritellä sen manuaalisesti?";

/* Dialog message */
"The server you specified is already configured.  Add process cancelled." = "Määritelty palvelin on jo määritelty. Lisäysprosessi kumottiin.";

/* Dialog message */
"There is already a computer in the directory with this name.  Do you wish to overwrite, this may disable another computer if it is in use?" = "Hakemistossa on jo tämänniminen tietokonetietue. Voit korvata tietueen, mutta tietueen korvaaminen saattaa estää toisen tietokoneen käytön, jos tietue on käytössä. Haluatko korvata tietueen?";

/* Dialog message */
"This computer is bound to this directory, do you wish to unbind?" = "Tämä tietokone on sidottu tähän hakemistoon. Haluatko poistaa sidoksen?";

/* Dialog message */
"Unable to add to this server to the configuration for an unknown reason.  Please use custom to continue this process." = "Tätä palvelinta ei voida lisätä määrittelyyn tuntemattomasta syystä. Jatka tätä prosessia käyttämällä muokattua.";

/* Dialog Title */
"Unable to contact directory" = "Hakemistoon ei voida yhdistää";

/* Dialog message */
"Unable to contact the directory to do the bind.  Operation cancelled." = "Hakemistoon ei voida yhdistää sitomista varten. Toiminto kumottiin.";

/* No comment provided by engineer. */
"Unbind\\U2026" = "Poista sidos…";

/* Dialog message */
"Unexpected error while attempting to bind.  Operation cancelled." = "Yritettäessä sitoa tapahtui odottamaton virhe. Toiminto kumottiin.";

/* Dialog Title */
"Unexpected error while binding" = "Sidottaessa tapahtui odottamaton virhe";

/* No comment provided by engineer. */
"Untitled %d" = "Nimetön %d";

/* No comment provided by engineer. */
"Use authentication when connecting" = "Käytä todentamista yhdistettäessä";

/* Status window message */
"Validating record/attribute mapping" = "Varmennetaan tietue/attribuutti-kuvausta";

/* Status window message */
"Validating the credentials that were supplied" = "Varmennetaan annettuja valtakirjoja";

/* No comment provided by engineer. */
"Write to server failed" = "Palvelimelle kirjoittaminen epäonnistui";

